import { Avatar, Box, Button, Center, Divider, Flex, HStack, Image, Text, VStack, Wrap } from '@chakra-ui/react'
import { Title } from '@mantine/core'
import dynamic from 'next/dynamic'
import React from 'react'
import { FaFacebook, FaTwitter } from 'react-icons/fa'
import BlogLeftSidebar from '../../Components/Blog/BlogLeftSidebar'
import BlogRightSidebar from '../../Components/Blog/BlogRightSidebar'
import TabContainer from '../../Components/HomePage/TabContainer'
import MainLeftSidebar from '../../Layouts/Common/MainLeftSidebar'
import MainRightSidebar from '../../Layouts/Common/MainRightSidebar'
import HomeLayout from '../../Layouts/HomeLayout'
import LayoutColumn from '../../Layouts/HomeLayout/LayoutColumn'


// import CommentInput from '../../Components/Blog/CommentInput'
const CommentInput = dynamic(import('../../Components/Blog/CommentInput'), { ssr: false })


export default function SingleBlogDetails() {
    return (
        <HomeLayout>

            <LayoutColumn
                // leftColumnWidth={26}
                leftSide={<BlogLeftSidebar />}
                rightSide={< BlogRightSidebar />}
                rightColumnWidth={12}
            >

                <Box mb={8} px={{ base: 0, md: 0 }}>


                    <Box py={2} bg={''} fontWeight='bold' rounded='sm' borderBottom={'2px'} borderColor='blackAlpha.100'>
                        <Title order={2}>সামাজিক যোগাযোগ মাধ্যম ও পাঠকের মন্তব্য</Title>
                    </Box>

                    <Box py={2} mb='2'>
                        <Text color='blackAlpha.600'>০৪ ঠা অক্টোবর, ২০২২ বিকাল ৫:৩৩</Text>
                    </Box>

                    <Box p={2} bg='blackAlpha.50'>
                        <HStack>
                            <Text color='blackAlpha.500'>পোস্টটি শেয়ার করুন </Text>
                            <Button size='xs' rounded={'none'} colorScheme='facebook' leftIcon={<FaFacebook />}>
                                Facebook
                            </Button>
                            <Button size={'xs'} rounded='none' colorScheme='twitter' leftIcon={<FaTwitter />}>
                                Twitter
                            </Button>
                        </HStack>
                    </Box>


                    <Center w={'full'} py={5}>
                        <Image maxW='full' maxH='400px' shadow='sm' src={'https://s3.amazonaws.com/somewherein/pictures/balchirabongal/balchirabongal-1664883109-9202d32_xlarge.jpg'} alt='name' />
                    </Center>

                    <Box mb={5} px={2} lineHeight={'28px'} fontSize={'18px'}>
                        বিশ্ব যতো প্রযুক্তির দিকে দৌড়াচ্ছে সমাজে নারীরা ততোই কোনঠাসা হয়ে পড়ছে। তাদের কোনঠাসা কে করছে? পুরুষরা কি নারীদের শাষক? কিংবা নারীরা কি পুরুষ দ্বারা শাসিত হবার বিধানে পড়ে? যদি না পড়ে তাহলে এর উদ্ভব হলো কিভাবে!

                        উদ্ভব হলো কতিপয় মানুষ, দল বা গোষ্ঠী; যারা নারীদের প্রযুক্তির পায়ে পা রেখে এগিয়ে যাওয়াকে মেনে নিতে পারছে না। তারা ভয়ে শঙ্কিত হয়ে আছে; নারীরা পুরুষের থেকে যেভাবে এগিয়ে চলেছে কোন একদিন এই পৃথিবীতে শাসকদলের বিলুপ্তি হবে। তাহলে পুরুষ শাসন করবে কাকে?

                        তাই আজকের পুরুষ শাসকরা ধর্মের দোহাই দিয়ে নারীদের শেকল পরাবার পায়তারায় ব্যস্ত। এতে করে কিন্তু হিতে বিপরীত হচ্ছে। পূনপূন নারীদের ব্যক্তিত্বে আঘাত করার ফলে তারা জেদী ও হিংস্র আচরন করছে।

                        সেদিনের ঘটনায় কি দোষ ছিল সেই তরনী মাসা আমিনীর। মাসা আমিনী ভাইয়ের সাথেই কাজে বেড়িয়েছিলেন। হিজাবও পরা ছিল মাথায় কিন্তু তার চুল অনেক লম্বা হওয়ায় তা হিজাবের বাইরে বেড়িয়ে আসে। তা দেখে ইরানের বিশেষ পুলিশ বাহিনী যারা নীতি পুলিশ বা ” গাইডেন্স পেট্রোল ” নামে পরিচিত। তারা তাকে গ্রেফতার করে। কথা কাটাকাটির একপর্যায়ে তাকে ব্যাটন দিয়ে পেটায় এবং গাড়ির দরজার সঙ্গে মাথা ধাক্কা মারে। গুরুত্বর অসুস্থ অবস্থায় মাসা আমিনীকে হাসপাতালে নেবার পর তিনি কোমায় চলে যান। এরপর আর কোমা থেকে তিনি ফেরেননি। সম্প্রতি ইরান এই তরুনী মাসা আমিনী হত্যার অভিযোগে উত্তাল। নারীরা তাদের চুল কেটে হিজাব পুড়িয়ে প্রতিবাদ করছে। রাস্তায় নেমে পড়েছে। আর এর ফলস্বরূপ গত একসপ্তাহে ইরানে প্রায় ৭৬ জনের মৃত্যু হয়েছে।

                        ইরানের বিভিন্ন ছবিতে দেখা যায়, পুরুষকে নানা রকম পোশাক পরিধান করা অবস্থায়। অথচ সেখানে নারীদের পোশাকের ব্যাপারে কঠোর আইন হয়েছে। আমরা তাহলে কি বুঝবো? পুরুষের জন্য ধর্মীয় কোন বিধান নেই কিংবা তাদের ধর্মীয় পোশাক নেই? ধর্ম, ধর্মীয় পোশাক, ধর্মীয় অনুশাসন কি শুধুই নারীদের জন্য?

                        নারীদের পোষাক যদি হিজাব, বোরকা, ঢিলেঢালা হয় তাহলে পুরুষের ধর্মীয় পোষাক হলো ঢিলেঢালা পাঞ্জাবী- পাজামা এবং পাগড়ী।

                        ইরানের কজন পুরুষ তা পরিধান করেন? এমনকি বিশ্বময় গলা ফাটানো পুরুষ দল যারা ধর্ম ও পোশাক শুধু নারীর জন্য নির্ধারন করে দিচ্ছেন তারাও ধর্মীয় লেবাসে নেই। দিব্যি হাঁটুর উপর প্যান্ট আর গায়ে সান্ডো গেঞ্জি ঝুলিয়ে ফেসবুক ভাসিয়ে ফেলছে নারীদের ধর্মীয় বিধান মানার ব্যাপারে। মাসা আমিনীকে মেরে ফেলার পরও তাদের পুলিশকে বাহবা দিচ্ছে।

                        আলহামদুলিল্লাহ – সুবহানাল্লাহর ছড়াছড়ি আমাদের দেশী ভাইদের। একজন মানুষকে পিটিয়ে কোমায় নিয়ে মেরে ফেললো। তবুও আমাদের দেশী ভাইয়েরা কেন এতো খুশি? তারা কি ধর্মীয় অনুসারী? কিংবা ইসলামপন্থী? মোটেও না। তিনি হয়তো নামাজ পড়াই জানেন না। এখানে শুধুমাত্র নারীরা কিভাবে অবদমিত থাকবে তারই অপচেষ্টা।

                        ভাই, আপনি নিজে যা মানছেন না তা কেন অন্যকে মানার জন্য অযথা কুটক্যাচাল বা চাপ প্রয়োগ করবেন? আর এর ফলে সাধারন পোশাক যেটি মানুষের নিজ নিজ রুচির পরিচায়ক তা দিনে দিনে বিশ্বময় একটা অরাজক পরিবেশ তৈরি করছে।

                        এই ইরান আজ থেকে দুইদশক আগেও এরকম কট্টরপন্থী ধর্মীয় নীতিতে বিশ্বাসী ছিল না। তারা যথেষ্ঠ স্বাধীন ও উদারপন্থী ছিল। ১৯৭৯ সালে আয়াতুল্লাহ খোমেনী ৪৩ বছর ফ্রান্সে নির্বাসিত জীবন যাপন শেষে ইরানে ফেরত আসেন। এবং ইরানে  ইসলামী বিপ্লবের ডাক দেন। সে সময় শাহর শাসকদের পরাজিত করে তিনি ইরানে ইসলামী শাসন কায়েম করেন। এরপর থেকেই ইরানে নারীদের কঠোর পর্দা প্রথা, কঠোর পোশাক বিধি, ঢিলেঢালা পোশাক পরিধান করার আইন বলবত হয়। নারীদের যাতে শরীরের কোন বাঁক স্পষ্ট না হয় তেমন পোশাক পরার নির্দেশ দেওয়া হয়। যে কোন ধর্মীয় অসংগতিতে নারীদের জেল জরিমানা করার বিধান রেখে এমন পোশাক পরতে বাধ্য করা হয়।

                        ২০০৪ সালে তেহরানের মেয়র মাহমুদ আহমাদিনেজাদ নির্বাচনে জিতে ইরানের প্রেসিডেন্ট নির্বাচিত হন। সেসময় তিনি “নীতি পুলিশ” নামে একটি পুলিশ বাহিনী গড়ে তোলেন। যারা বর্তমানে ইরানের আইন শৃঙ্খলা রক্ষাকারী বাহিনীর সাথে কাজ করছেন।

                        নীতি পুলিশের এক একটি দলে ৬ জন সদস্য থাকেন। তাদের মধ্যে ৩ জন নারী সদস্য ৩ জন পুরুষ রয়েছেন। এদের কাজ হলো শহরময় টহল দেয়া। বিশেষ করে জনসমাগম যেখানে বেশি; যেমন মার্কেট, পার্ক এসব জায়গায় টহল দেয়া ও পর্যবেক্ষন করা যে নারী ধর্মীয় পোশাকবিধি অমান্য করছে কিনা।

                        এছাড়াও মুখে অতিরিক্ত মেকআপ করেছে কিনা, পোশাক অতি টাইট বা চাপা কিনা, চুল দেখা যায় কিনা এসব। এবং এসব তারা দেখাশোনা করতে গিয়ে প্রতিনিয়ত একটি করে অঘটন ঘটাচ্ছেন।

                        আজ যে নীতি পুলিশের নির্যাতনের শিকার হয়ে ইরানের তরুণী মৃত্যুবরন করেছে; সরকার এ ব্যাপারে প্রত্যক্ষ্যভাবে জড়িত। কেননা তাদের আইন হলো প্রতিদিন একটি করে মামলা না দিলে নীতি পুলিশকে বরখাস্ত করা, বেতন কর্তন করা হয়। এই ভয়ে নীতি পুলিশ নারীদের সাথে ভীষন পৈশাচিক আচরন করেন।

                        মাসা আমিনী হত্যার রেশ আস্তে আস্তে এশিয়াতেও ছড়িয়ে পড়ছে। ইতিহাস ঘাটলে দেখা যায়, এমন তুচ্ছ বিষয়ে উস্কানিমূলক আচরণের কারনে গৃহযুদ্ধসহ বিশ্বযুদ্ধেও গড়াতে পারে।

                        শেষ জামানায় নাকি দজ্জালের আগমন হবে। তার আগমনের পর তার অনুসারী হবে একটি দল। দজ্জালরা যখন নিরীহ মানুষ হত্যা করবে, হানাহানী করবে, অশান্তি করবে। তখন তাদের অনুসারী দলেরা পাশে থেকে দজ্জালকে বাহবা দেবে; করতালী দেবে এবং উৎসাহী করে তুলবে আরও হত্যা ও অশান্তি করার জন্য। আমরা যার নমুনা বেশ দেখতে পাচ্ছি। অবশ্যই সেই পুরুষগনই দজ্জালের অনুসারী হবেন; যারা অকারন নিরীহ নারীদের উপর অত্যাচার; হত্যায় বাহবা দিয়ে বিশ্বময় অস্থিরতা বিরাজ করতে সামিল!!!
                    </Box>





                    <Box shadow={'sm'}>
                        <Box p={3} mb={2} bg='blackAlpha.50'>
                            <Title order={5}>মন্তব্য করুন</Title>
                        </Box>

                        <Box p={0}>
                            <CommentInput />
                        </Box>
                    </Box>

                </Box>


            </LayoutColumn>

        </HomeLayout>
    )
}
